# Pandas

# 1. Import

In [1]:
import pandas as pd

In [2]:
# We will need NumPy for some exercises
import numpy as np

# 2. Pandas Series

## 2.1 Create a Series

### 2.1.1 Create a Series from a list

In [3]:
mylist = [1, 2, 3]

In [4]:
labels = ['a', 'b', 'c']

In [5]:
s = pd.Series(data=mylist)
s

0    1
1    2
2    3
dtype: int64

In [6]:
s = pd.Series(data=mylist, index=labels)
s

a    1
b    2
c    3
dtype: int64

### 2.1.2 Create a Series from a dictionary

In [7]:
d = {'a': 10, 'b': 20, 'c': 30}

In [8]:
s = pd.Series(d)
s

a    10
b    20
c    30
dtype: int64

## 2.2 Accessing data from a Series with index

In [9]:
s[0]

10

## 2.3 Accessing data from a Series with label

In [10]:
s['a']

10

# 3. Pandas DataFrame

## 3.1 Create a DataFrame

### 3.1.1 Create a DataFrame from a dictionary

In [11]:
mydict = {
    0: {
        'name': 'Wadie',
        'age': 28,
        'position': 'PhD Student',
        'university': 'Eötvös Loránd University',
        'start_year': 2021
    },
    1: {
        'name': 'John',
        'age': 30,
        'position': 'Data Scientist',
        'university': 'Eötvös Loránd University',
        'start_year': 2019
    },
    2: {
        'name': 'Jane',
        'age': 25,
        'position': 'Assistant Professor',
        'university': 'University of Szeged',
        'start_year': 2020
    }
}

In [12]:
df = pd.DataFrame(mydict)
df

,0,1,2
name,Wadie,John,Jane
age,28,30,25
position,PhD Student,Data Scientist,Assistant Professor
university,Eötvös Loránd University,Eötvös Loránd University,University of Szeged
start_year,2021,2019,2020

In [13]:
df = pd.DataFrame.from_dict(mydict, orient='index')
df

    name  age             position                university  start_year
0  Wadie   28          PhD Student  Eötvös Loránd University        2021
1   John   30       Data Scientist  Eötvös Loránd University        2019
2   Jane   25  Assistant Professor      University of Szeged        2020

### 3.1.2 Create a DataFrame from a Matrix

In [14]:
myarray = np.random.randn(10 ,6)
myarray

array([[-0.62322794, -1.25186134,  0.5395114 ,  1.47165734, -0.50853869,
         1.26674787],
       [-0.38172844,  0.0023127 , -0.60478541,  0.66128025,  0.49102873,
         0.4689521 ],
       [ 0.49154853, -0.43874841,  0.0269443 ,  0.55955513, -0.57977351,
        -0.2643289 ],
       [-0.98891263,  1.01947041,  0.53058676, -0.18708289,  0.80456128,
        -1.05580246],
       [ 0.75600894, -1.03266621,  1.02500615, -1.83034244, -1.94530536,
         1.22537285],
       [ 1.34885488,  0.4180047 ,  0.57663206, -2.13558292, -1.90535158,
        -0.8644411 ],
       [-0.62701099, -0.77258187, -0.37643097,  0.40134809, -0.69680367,
        -0.16243846],
       [ 1.61536622,  1.70202555, -0.2845477 , -0.36742406,  0.38035288,
         0.81466364],
       [-0.26385251,  0.80069936, -0.54303595,  0.11377419,  1.59692325,
        -0.97213558],
       [-0.38879511,  0.80316799, -0.33837565, -0.62301988, -1.67516942,
         0.1370955 ]])

In [15]:
df = pd.DataFrame(myarray, columns=['A', 'B', 'C', 'D', 'E', 'F'])
df

          A         B         C         D         E         F
0 -0.623228 -1.251861  0.539511  1.471657 -0.508539  1.266748
1 -0.381728  0.002313 -0.604785  0.661280  0.491029  0.468952
2  0.491549 -0.438748  0.026944  0.559555 -0.579774 -0.264329
3 -0.988913  1.019470  0.530587 -0.187083  0.804561 -1.055802
4  0.756009 -1.032666  1.025006 -1.830342 -1.945305  1.225373
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441
6 -0.627011 -0.772582 -0.376431  0.401348 -0.696804 -0.162438
7  1.615366  1.702026 -0.284548 -0.367424  0.380353  0.814664
8 -0.263853  0.800699 -0.543036  0.113774  1.596923 -0.972136
9 -0.388795  0.803168 -0.338376 -0.623020 -1.675169  0.137095

## 3.2 Describe a DataFrame

In [16]:
df.describe()

               A          B          C          D          E          F
count  10.000000  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.093825   0.124982   0.055151  -0.193584  -0.403808   0.059369
std     0.899380   0.981149   0.569977   1.114773   1.213521   0.874110
min    -0.988913  -1.251861  -0.604785  -2.135583  -1.945305  -1.055802
25%    -0.564620  -0.689124  -0.366917  -0.559121  -1.430578  -0.714413
50%    -0.322790   0.210159  -0.128802  -0.036654  -0.544156  -0.012671
75%     0.689894   0.802551   0.537280   0.520003   0.463360   0.728236
max     1.615366   1.702026   1.025006   1.471657   1.596923   1.266748

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
 4   E       10 non-null     float64
 5   F       10 non-null     float64
dtypes: float64(6)
memory usage: 608.0 bytes

In [18]:
df.shape

(10, 6)

In [19]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [21]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
F    float64
dtype: object

In [22]:
df.head()

          A         B         C         D         E         F
0 -0.623228 -1.251861  0.539511  1.471657 -0.508539  1.266748
1 -0.381728  0.002313 -0.604785  0.661280  0.491029  0.468952
2  0.491549 -0.438748  0.026944  0.559555 -0.579774 -0.264329
3 -0.988913  1.019470  0.530587 -0.187083  0.804561 -1.055802
4  0.756009 -1.032666  1.025006 -1.830342 -1.945305  1.225373

In [26]:
df.head(3)

          A         B         C         D         E         F
0 -0.623228 -1.251861  0.539511  1.471657 -0.508539  1.266748
1 -0.381728  0.002313 -0.604785  0.661280  0.491029  0.468952
2  0.491549 -0.438748  0.026944  0.559555 -0.579774 -0.264329

In [23]:
df.tail()

          A         B         C         D         E         F
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441
6 -0.627011 -0.772582 -0.376431  0.401348 -0.696804 -0.162438
7  1.615366  1.702026 -0.284548 -0.367424  0.380353  0.814664
8 -0.263853  0.800699 -0.543036  0.113774  1.596923 -0.972136
9 -0.388795  0.803168 -0.338376 -0.623020 -1.675169  0.137095

In [24]:
df.sample()

          A         B         C         D         E         F
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441

In [25]:
df.sample(3)

          A         B         C         D         E         F
0 -0.623228 -1.251861  0.539511  1.471657 -0.508539  1.266748
2  0.491549 -0.438748  0.026944  0.559555 -0.579774 -0.264329
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441

## 3.3 DataFrame Indexing and Selection

In [27]:
df['A']

0   -0.623228
1   -0.381728
2    0.491549
3   -0.988913
4    0.756009
5    1.348855
6   -0.627011
7    1.615366
8   -0.263853
9   -0.388795
Name: A, dtype: float64

In [28]:
df[['A', 'B']]

          A         B
0 -0.623228 -1.251861
1 -0.381728  0.002313
2  0.491549 -0.438748
3 -0.988913  1.019470
4  0.756009 -1.032666
5  1.348855  0.418005
6 -0.627011 -0.772582
7  1.615366  1.702026
8 -0.263853  0.800699
9 -0.388795  0.803168

In [29]:
df.loc[0, 'A']

-0.6232279411145251

In [30]:
df.iloc[0, 0]

-0.6232279411145251

In [31]:
df.loc[0:3, 'A':'C']

          A         B         C
0 -0.623228 -1.251861  0.539511
1 -0.381728  0.002313 -0.604785
2  0.491549 -0.438748  0.026944
3 -0.988913  1.019470  0.530587

In [32]:
df.iloc[0:3, 0:3]

          A         B         C
0 -0.623228 -1.251861  0.539511
1 -0.381728  0.002313 -0.604785
2  0.491549 -0.438748  0.026944

In [33]:
df > 0

       A      B      C      D      E      F
0  False  False   True   True  False   True
1  False   True  False   True   True   True
2   True  False   True   True  False  False
3  False   True   True  False   True  False
4   True  False   True  False  False   True
5   True   True   True  False  False  False
6  False  False  False   True  False  False
7   True   True  False  False   True   True
8  False   True  False   True   True  False
9  False   True  False  False  False   True

In [34]:
df[df > 0]

          A         B         C         D         E         F
0       NaN       NaN  0.539511  1.471657       NaN  1.266748
1       NaN  0.002313       NaN  0.661280  0.491029  0.468952
2  0.491549       NaN  0.026944  0.559555       NaN       NaN
3       NaN  1.019470  0.530587       NaN  0.804561       NaN
4  0.756009       NaN  1.025006       NaN       NaN  1.225373
5  1.348855  0.418005  0.576632       NaN       NaN       NaN
6       NaN       NaN       NaN  0.401348       NaN       NaN
7  1.615366  1.702026       NaN       NaN  0.380353  0.814664
8       NaN  0.800699       NaN  0.113774  1.596923       NaN
9       NaN  0.803168       NaN       NaN       NaN  0.137095

In [35]:
df['A'] > 0

0    False
1    False
2     True
3    False
4     True
5     True
6    False
7     True
8    False
9    False
Name: A, dtype: bool

In [36]:
df[df['A'] > 0]

          A         B         C         D         E         F
2  0.491549 -0.438748  0.026944  0.559555 -0.579774 -0.264329
4  0.756009 -1.032666  1.025006 -1.830342 -1.945305  1.225373
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441
7  1.615366  1.702026 -0.284548 -0.367424  0.380353  0.814664

In [37]:
df[(df['A'] > 0) & (df['B'] > 0)]

          A         B         C         D         E         F
5  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441
7  1.615366  1.702026 -0.284548 -0.367424  0.380353  0.814664

In [38]:
df_2 = df[(df['A'] > 0) & (df['B'] > 0)]
df_2.reset_index(drop=True, inplace=True)
df_2

          A         B         C         D         E         F
0  1.348855  0.418005  0.576632 -2.135583 -1.905352 -0.864441
1  1.615366  1.702026 -0.284548 -0.367424  0.380353  0.814664

## 3.4 Missing Data

In [39]:
df = pd.DataFrame({
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [40]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [41]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [42]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [43]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

## 3.5 MultiIndex and Index Hierarchy

In [44]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1  0.201754 -0.132390
   2  0.826105 -0.281313
   3  1.445526 -0.771679
G2 1  0.038270  0.687288
   2  3.329302 -1.033233
   3 -0.772112 -0.995811

In [46]:
df.loc['G1']

          A         B
1  0.201754 -0.132390
2  0.826105 -0.281313
3  1.445526 -0.771679

In [47]:
df.loc['G1'].loc[1]

A    0.201754
B   -0.132390
Name: 1, dtype: float64

In [48]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.201754 -0.132390
       2    0.826105 -0.281313
       3    1.445526 -0.771679
G2     1    0.038270  0.687288
       2    3.329302 -1.033233
       3   -0.772112 -0.995811

In [49]:
df.xs('G1')

            A         B
Num
1    0.201754 -0.132390
2    0.826105 -0.281313
3    1.445526 -0.771679

In [52]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.201754 -0.132390
G2      0.038270  0.687288

## 3.6 GroupBy

In [53]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [54]:
df_group = df.groupby('Company')
df_group

In [55]:
df_group.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
df_group.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [57]:
df_group.get_group('FB')

  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350

## 3.7 Merging, Joining, and Concatenating

In [58]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3'],
                    'D':['D0', 'D1', 'D2', 'D3'],
                    }, index = [0,1,2,3])

df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5', 'C6', 'C7'],
                    'D':['D4', 'D5', 'D6', 'D7'],
                    }, index = [4,5,6,7])

df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'D':['D8', 'D9', 'D10', 'D11'],
                    }, index = [8,9,10,11])

In [62]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [64]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [65]:
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [67]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [68]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']
                     }, index = ['K0','K1','K2','K3'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [69]:
right = pd.DataFrame({'C':['C0','C2','C4','C5'],
                      'D':['D0','D2','D4','D5']
                      }, index = ['K0','K2','K4','K5'])
right

     C   D
K0  C0  D0
K2  C2  D2
K4  C4  D4
K5  C5  D5

In [70]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3  NaN  NaN

In [71]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K4  C4  D4  NaN  NaN
K5  C5  D5  NaN  NaN

In [72]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3  NaN  NaN
K4  NaN  NaN   C4   D4
K5  NaN  NaN   C5   D5

In [73]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

## 3.8 Operations

### 3.8.1 apply function

In [74]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [77]:
# col2 * 2 and store it in col 4

In [78]:
df['col4'] = df['col2'].apply(lambda x: x * 2)

In [79]:
df

   col1  col2 col3  col4
0     1   444  abc   888
1     2   555  def  1110
2     3   666  ghi  1332
3     4   444  xyz   888

### 3.8.2 transform function

In [80]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
# col2 * 3 then *2 then store it in col4

In [81]:
df['col4'] = df['col2'].transform([lambda x: x * 2, lambda x: x * 3])

In [83]:
df

   col1  col2 col3  col4
0     1   444  abc  1332
1     2   555  def  1665
2     3   666  ghi  1998
3     4   444  xyz  1332

## 3.9 Data Input and Output

### 3.9.1 Read data

In [84]:
df = pd.read_csv('datasets/concave_dataset.txt', delimiter='\t', header=None)
df

         0      1  2
0     0.85  17.45  2
1     0.75  15.60  2
2     3.30  15.45  2
3     5.25  14.20  2
4     4.90  15.65  2
..     ...    ... ..
368  38.75  16.85  1
369  39.00  16.60  1
370  38.25  17.35  1
371  39.50  16.95  1
372  39.90  17.05  1

[373 rows x 3 columns]

In [85]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')[0]
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

### 3.9.2 Write data

In [86]:
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [87]:
df.to_csv('datasets/my_output.csv', index=False)

In [88]:
df.to_excel('datasets/my_output.xlsx', index=False)

# 4. Exercises

## 4.1 Exercise 1

## Create a DataFrame from the following data: Names, and group numbers for the students of the course Introduction to Data Science (only practical part). [The data can be fetched from Neptun]. Then do the following:
## 1. Assign a random mark (between 1 and 5) to each student in a new column called 'mark'.
## 2. Give every student a unique ID number (starting from 1) in a new column called 'ID'.
## 3. Calculate the average mark of the students.
## 4. Calculate the average mark of the students in each group.
## 5. Get the names of the students who got the highest mark.
## 6. Get the names of the students who got the highest mark in each group.
## 7. Convert the DataFrame to a multi-indexed DataFrame with the group number as the first level and the ID number as the second level.